---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData
source: html/22aeb525-b015-b42c-e212-0acd5b640616.htm
---
# AnalyticalDistributionNodePropertyData Members

Releases all resources used by the AnalyticalDistributionNodePropertyData